src/Documents/РасходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РасходныйКассовыйОрдер</Name>
			<BasedOn>
				<xr:Item>Document.Реализация</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровИУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРасходаДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/ВидыОперацийРасходаДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходаДенег</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/РасходныйКассовыйОрдер/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Формирует структуру аналитики проводки для заполнения движения по `РегистрыБухгалтерии.Хозрасчетный`
//  для отражения операции расхода денег из кассы.
//  Не заполняет поле `СчетКредита`, счет кредита должен быть установлен при создании движения.
// Параметры:
//	видОперации - ПеречислениеСсылка.ВидыОперацийПоступленияДенег
//  значенияПолей - Структура, ФиксированнаяСтруктура
//      * Касса - СправочникСсылка.Кассы
//      * Получатель - СправочникСсылка.Контрагенты, СправочникСсылка.Сотрудники
//      * Сумма - Число
// Возвращаемое значение:
//	- Структура
//      * СчетДебета - ПланСчетовСсылка.Хозрасчетный - [`РасчетыСПоставщиками`, `РасчетыСПокупателями`, `РасчетыСПерсоналомПоОплатеТруда`, `РасчетыСПодотчетнымиЛицами`]
//      * СубконтоКредит - СправочникСсылка.Кассы
//      * СубконтоДебет - СправочникСсылка.Контрагенты, СправочникСсылка.Сотрудники
//      * СодержаниеОперации - Строка
//      * Сумма - Число
Функция ПолучитьАналитикуПроводки(Знач видОперации, Знач значенияПолей) Экспорт
    структураАналитики = Новый Структура;
    структураАналитики.Вставить("СчетДебета", Неопределено);
    структураАналитики.Вставить("СубконтоДебет", значенияПолей.Получатель);
    структураАналитики.Вставить("СубконтоКредит", значенияПолей.Касса);
    структураАналитики.Вставить("СодержаниеОперации", Неопределено);
    структураАналитики.Вставить("Сумма", значенияПолей.Сумма);

    структураАналитики.СубконтоДебет = значенияПолей.Получатель;

    Если видОперации = Перечисления.ВидыОперацийРасходаДенег.ОплатаПоставщику Тогда
        // Оплата поставщику
        структураАналитики.СчетДебета = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
        структураАналитики.СодержаниеОперации = "Оплата поставщику наличными из кассы";

    ИначеЕсли видОперации = Перечисления.ВидыОперацийРасходаДенег.ВозвратПокупателю Тогда
        // Возврат денег покупателю
        структураАналитики.СчетДебета = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
        структураАналитики.СодержаниеОперации = "Возврат покупателю наличными из кассы";

    ИначеЕсли видОперации = Перечисления.ВидыОперацийРасходаДенег.ВыдачаЗаработнойПлаты Тогда
        // Выплата заработной платы
        структураАналитики.СчетДебета = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
        структураАналитики.СодержаниеОперации = "Выплата заработной платы наличными из кассы";

    ИначеЕсли видОперации = Перечисления.ВидыОперацийРасходаДенег.ВыдачаПодотчетнику Тогда
        // Выдача денег подотчетнику
        структураАналитики.СчетДебета = ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами;
        структураАналитики.СодержаниеОперации = "Выдача денежных средств подотчётному лицу";

    Иначе
        ДиагностикаКлиентСервер.Утверждение(Ложь, "Недопустимый вид операции.");
    КонецЕсли;

    Возврат структураАналитики;
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
